<template>
  <div class="warning-meaning">
    <div class="top">
      <router-link
        class="return"
        to="/warning/meaning"
      >预警信号含义指引</router-link>
      <a
        class="download"
        href="/yujing/gdfyzy.doc"
      >《广东省突发气象灾害预警信号及防御指引》下载</a>
    </div>
    <div class="nav">
      <router-link
        :class="[{'first':index==0},{'current':current==item.path}]"
        v-for="(item,index) in navList"
        :key="item.path"
        :to="item.path"
      >{{item.title}}</router-link>
    </div>
    <router-view :list="currentData"></router-view>
  </div>
</template>
<script>
// 预警信号含义


export default {
  mounted() {
    let current = this.$router.history.current.name;
    this.current = current
    this.currentData = this.meaningList[current]
  },
  beforeRouteUpdate(to, from, next) {
    this.current = to.name
    this.currentData = this.meaningList[to.name]
    next()
  },
  data() {
    return {
      current: '',
      currentData: [],
      navList: [
        {
          title: "台风",
          path: 'typhoon'
        }, {
          title: "暴雨",
          path: 'rainstorm'
        }, {
          title: "高温",
          path: 'heatwave'
        }, {
          title: "寒冷",
          path: 'cold'
        }, {
          title: "大雾",
          path: 'heavyfog'
        }, {
          title: "灰霾",
          path: 'haze'
        }, {
          title: "雷雨大风",
          path: 'thundergust'
        }, {
          title: "道路结冰",
          path: 'roadicing'
        }, {
          title: "冰雹",
          path: 'hail'
        }, {
          title: "森林火险",
          path: 'wildfire'
        }
      ],
      meaningList: {
        typhoon: [
          {
            icon: '/yujing/image/typhoon_white.png',
            meaning: '48小时内将受台风影响。',
            guide: [
              '1.进入台风注意状态，警惕台风对当地的影响。',
              '2.注意通过气象信息传播渠道了解台风的最新情况。'
            ]
          }, {
            icon: '/yujing/image/typhoon_blue.png',
            meaning: '24小时内将受台风影响，平均风力可达6级以上，或者阵风8级以上；或者已经受台风影响，平均风力为6～7级，或者阵风8～9级并将持续。',
            guide: [
              '1.进入台风戒备状态，做好防御台风准备。',
              '2.注意了解台风最新消息和政府及有关部门防御台风通知。',
              '3.加固紧门窗和板房、铁皮屋、棚架等临时搭建物， 妥善安置室外物品搁置物和悬挂物。',
              '4.海水养殖、海上作业人员应当适时撤离，船舶应当及时回港避风或者采取其他避风措施。'
            ]
          }, {
            icon: '/yujing/image/typhoon_yellow.png',
            meaning: '24小时内将受台风影响，平均风力可达8级以上，或者阵风10级以上；或者已经受台风影响， 平均风力为8～9级，或者阵风10～11级并将持续。',
            guide: [
              '1.进入台风防风状态，密切关注台风最新消息和政府及有关部门发布的防御台风通知。',
              '2.中小学校、幼儿园、托儿所应当停课，未启程上学的学生不必到校上课；上学、放学途中的学生应当就近到安全场所暂避或者在安全情况下回家；学校应当妥善安置在校（含校车上、寄宿）学生，在确保安全的情况下安排学生离校回家。',
              '3.居民应当关紧门窗，妥善安置室外搁置物和悬挂物，尽量避免外出；处于危险地带和危房中的人员应当及时撤离，确保留在安全场所。',
              '4.停止户外集体活动，停止高空等户外作业。',
              '5.滨海浴场、景区、公园、游乐场应当适时停止营业，关闭相关区域，组织人员避险。',
              '6.海水养殖、海上作业人员应当撤离，回港避风船舶不得擅自离港，并做好防御措施。',
              '7.相关应急处置部门和抢险单位加强值班，实时关注灾情，落实应对措施。'
            ]
          }, {
            icon: '/yujing/image/typhoon_orange.png',
            meaning: '12小时内将受台风影响，平均风力可达10级以上，或者阵风12级以上；或者已经受台风影响，平均风力为10～11级，或者阵风12级并将持续。',
            guide: [
              '1.进入台风紧急防御状态，密切关注台风最新消息和政府及有关部门发布的防御台风通知。',
              '2.中小学校、幼儿园、托儿所应当停课，学校应当妥善安置寄宿学生。',
              '3.居民避免外出，确保留在安全场所。',
              '4.停止室内大型集会，立即疏散人员；。',
              '5.滨海浴场、景区、公园、游乐场应当停止营业，迅速组织人员避险。',
              '6.加固港口设施；船舶应当落实防御措施，防止走锚、搁浅和碰撞。',
              '7.相关应急处置部门和抢险单位密切监视灾情，做好应急抢险救灾工作。'
            ]
          }, {
            icon: '/yujing/image/typhoon_red.png',
            meaning: '12小时内将受或者已经受台风影响，平均风力可达12级以上，或者已达12级以上并将持续。',
            guide: [
              '1.进入台风特别紧急防御状态，密切关注台风最新消息和政府及有关部门发布的防御台风通知。',
              '2.中小学校、幼儿园、托儿所应当停课，学校应当妥善安置寄宿学生；建议用人单位停工（特殊行业除外），并为滞留人员提供安全的避风场所。',
              '3.居民切勿外出，确保留在安全场所。',
              '4.当台风中心经过时风力会减小或者静止一段时间，应当保持戒备和防御，以防台风中心经过后强风再袭。',
              '5.相关应急处置部门和抢险单位严密监视灾情，做好应急抢险救灾工作。'
            ]
          }
        ],
        rainstorm: [
          {
            icon: '/yujing/image/rain_storm_yellow.png',
            meaning: '6小时内本地将有暴雨发生，或者已经出现明显降雨，且降雨将持续。',
            guide: [
              '1.进入暴雨戒备状态，关注暴雨最新消息。',
              '2.中小学校、幼儿园、托儿所应当采取适当措施，保证学生和幼儿安全。',
              '3.驾驶人员应当注意道路积水和交通阻塞，确保安全。',
              '4.做好低洼、易涝地区的排水防涝工作。'
            ]
          }, {
            icon: '/yujing/image/rain_storm_orange.png',
            meaning: '在过去的3小时，本地降雨量已达50毫米以上，且降雨将持续。',
            guide: [
              '1.进入暴雨防御状态，密切关注暴雨最新消息。',
              '2.学生可以延迟上学；上学、放学途中的学生应当就近到安全场所暂避。',
              '3.暂停户外作业和活动，尽可能停留在安全场所暂避。',
              '4.行驶车辆应当尽量绕开积水路段及下沉式立交桥，避免穿越水浸道路，避免将车辆停放在低洼易涝等危险区域。',
              '5.相关应急处置部门和抢险单位加强值班，密切监视灾情，对积水地区实行交通疏导和排水防涝；转移危险地带和危房中的人员到安全场所暂避。',
              '6.注意防范暴雨可能引发的内涝、山洪、滑坡、泥石流等灾害。'
            ]
          }, {
            icon: '/yujing/image/rain_storm_red.png',
            meaning: '在过去的3小时，本地降雨量已达100毫米以上，且降雨将持续。',
            guide: [
              '1.进入暴雨紧急防御状态，密切关注暴雨最新消息和政府及有关部门发布的防御暴雨通知。',
              '2.中小学校、幼儿园、托儿所应当停课，未启程上学的学生不必到校上课；上学、放学途中的学生应当在安全情况下回家或者就近到安全场所暂避；学校应当保障在校（含校车上、寄宿）学生的安全。',
              '3.停止户外作业和活动，人员应当留在安全场所暂避；危险地带和危房中的人员应当撤离。',
              '4.地铁、地下商城、地下车库、地下通道等地下设施和场所的经营管理单位应当采取有效措施避免和减少损失，保障人员安全。',
              '5.行驶车辆应当就近到安全区域暂避，避免将车辆停放在低洼易涝等危险区域，如遇严重水浸等危险情况应当立即弃车逃生。',
              '6.相关应急处置部门和抢险单位应当严密监视灾情，做好暴雨及其引发的内涝、山洪、滑坡、泥石流等灾害应急抢险救灾工作。'
            ]
          }
        ],
        heatwave: [
          {
            icon: '/yujing/image/heat_wave_yellow.png',
            meaning: '天气闷热， 24小时内最高气温将升至35℃或者已达到35℃以上。',
            guide: [
              '1.注意防暑降温。',
              '2.避免长时间户外露天作业或者在高温条件下作业。',
              '3.加强防暑降温保健知识的宣传。'
            ]
          },
          {
            icon: '/yujing/image/heat_wave_orange.png',
            meaning: '天气炎热，24小时内最高气温将升至37℃以上或者已经达到37℃以上。',
            guide: [
              '1.做好防暑降温，高温时段尽量避免户外活动，暂停户外露天作业。',
              '2.注意防范因电线、变压器等电力设备负载过大而引发火灾。',
              '3.注意作息时间，保证睡眠，必要时准备一些常用的防暑降温药品。',
              '4.有关单位落实防暑降温保障措施，提供防暑降温指导，有条件的地区开放避暑场所。',
              '5.有关部门应当加强食品卫生安全监督检查。'
            ]
          }, {
            icon: '/yujing/image/heat_wave_red.png',
            meaning: '天气酷热，24小时内最高气温将升至39℃以上。',
            guide: [
              '1.采取有效措施防暑降温，白天尽量减少户外活动。',
              '2.对老、弱、病、幼、孕人群采取保护措施。',
              '3.除特殊行业外，停止户外露天作业。',
              '4.单位和个人要特别注意防火。',
              '5.有关单位按照职责采取防暑降温应急措施，有条件的地区开放避暑场所。'
            ]
          }
        ],
        cold: [
          {
            icon: '/yujing/image/cold_yellow.png',
            meaning: '预计因冷空气侵袭，当地气温在24小时内急剧下降10℃以上，或者日平均气温维持在12℃以下。',
            guide: [
              '1.关注寒冷天气最新消息和政府及有关部门发布的防御寒冷通知。',
              '2.注意做好防寒和防风工作，居民适时添衣保暖。'
            ]
          },
          {
            icon: '/yujing/image/cold_orange.png',
            meaning: '预计因冷空气侵袭，当地最低气温将降到5℃以下或者日平均气温维持在10℃以下。',
            guide: [
              ' 1.密切关注寒冷天气最新消息和政府及有关部门发布的防御寒冷通知。',
              '2.居民尤其是老、弱、病、幼、孕人群做好防寒保暖工作。',
              '3.采取防寒救助措施，适时开放避寒场所。',
              '4.做好牲畜、家禽的防寒防风，对热带、亚热带水果及有关水产、农作物等采取防寒措施。',
              '5.高寒地区应当采取防霜冻、冰冻措施。'
            ]
          }, {
            icon: '/yujing/image/cold_red.png',
            meaning: '预计因冷空气侵袭，当地最低气温将降到0℃以下或者日平均气温维持在5℃以下。',
            guide: [
              '1.严密关注寒冷天气最新消息和政府及有关部门发布的防御寒冷通知。',
              '2.居民尤其是老、弱、病、幼、孕人群加强防寒保暖工作。',
              '3.采取防寒救助措施，开放避寒场所。',
              '4.农业、林业、水产业、畜牧业、交通运输、供电等单位应当采取防寒防冻措施。',
              '5.相关应急处置部门和抢险单位应当做好灾害应急抢险救灾工作。'
            ]
          }
        ],
        heavyfog: [
          {
            icon: '/yujing/image/heavy_fog_yellow.png',
            meaning: '12小时内将出现能见度小于500米的雾，或者已经出现能见度小于500米、大于等于200米的雾且将持续。',
            guide: [
              '1.驾驶人员注意安全，小心驾驶。',
              '2.机场、轨道交通、高速公路、港口码头等经营管理单位加强管理，保障安全。',
              '3.户外活动注意安全。'
            ]
          },
          {
            icon: '/yujing/image/heavy_fog_orange.png',
            meaning: '6小时内将出现能见度小于200米的雾，或者已经出现能见度小于200米、大于等于50米的雾且将持续。',
            guide: [
              '1.驾驶人员应控制车、船行驶速度，确保安全；。',
              '2.机场、轨道交通、高速公路、轮渡港口码头等经营管理单位采取有效措施，加强调度指挥，保障安全。',
              '3.减少户外活动。'
            ]
          }, {
            icon: '/yujing/image/heavy_fog_red.png',
            meaning: '2小时内将出现能见度低于50米的雾，或者已经出现能见度低于50米的雾且将持续。',
            guide: [
              '1.有关单位按照行业规定适时采取交通安全管制措施，如机场暂停飞机起降、高速公路暂时封闭、轮渡暂时停航。',
              '2.各类机动交通工具采取有效措施保障安全。',
              '3.驾驶人员采取合理行驶方式，并尽快寻找安全停放区域停靠。',
              '4.避免户外活动。'
            ]
          }
        ],
        haze: [
          {
            icon: '/yujing/image/haze_yellow.png',
            meaning: '12小时内将出现灰霾天气，或者已经出现灰霾天气且将持续。',
            guide: [
              '1.驾驶人员注意安全，小心驾驶。',
              '2.机场、高速公路、港口码头等经营管理单位采取措施，保障安全。',
              '3.居民需适当防护，减少户外活动，建议中小学校、幼儿园、托儿所适时停止户外活动。'
            ]
          }
        ],
        thundergust: [
          {
            icon: '/yujing/image/thunder_gust_yellow.png',
            meaning: '6小时内本地将受雷雨天气影响，平均风力可达6级以上，或者阵风8级以上，并伴有强雷电；或者已经受雷雨天气影响，平均风力达6～7级，或者阵风8～9级，并伴有强雷电，且将持续。',
            guide: [
              '1.关注雷雨大风最新消息和有关防御通知，做好防御大风、雷电工作。',
              '2.及时停止户外集体活动，停止高空等户外作业。',
              '3.居民应当关紧门窗，妥善安置室外搁置物和悬挂物，尽量避免外出，留在有雷电防护装置的安全场所暂避。',
              '4.公园、景区、游乐场等户外场所应当做好防护措施，确保人员安全。',
              '5.采取必要措施，保障易受雷击的设备设施和场所的安全。',
              '6.机场、轨道交通、高速公路、港口码头等经营管理单位应当采取措施，保障安全。'
            ]
          },
          {
            icon: '/yujing/image/thunder_gust_orange.png',
            meaning: '2小时内本地将受雷雨天气影响，平均风力可达8级以上，或者阵风10级以上，并伴有强雷电；或者已经受雷雨天气影响，平均风力为8～9级，或者阵风10～11级，并伴有强雷电，且将持续。',
            guide: [
              '1.密切关注雷雨大风最新消息和有关防御通知，迅速做好防御大风、雷电工作。',
              '2.立即停止户外活动和作业。',
              '3.居民应当关紧门窗，妥善安置室外搁置物和悬挂物。',
              '4.居民应当避免外出，远离户外广告牌、棚架、铁皮屋、板房等易被大风吹动的搭建物，切勿在树下、电杆下、塔吊下躲避，应当留在有雷电防护装置的安全场所暂避。',
              '5.公园、景区、游乐场等户外场所应当及时发出警示信息，适时关闭相关区域，停止营业，组织居民避险。',
              '6.在建工地应当采取防护措施，加强工棚、脚手架、井架等设施和塔吊、龙门吊、升降机等机械、电器设备的安全防护，保障居民安全。',
              '7. 机场、轨道交通、高速公路、港口码头等经营管理单位应当迅速采取措施，确保安全。',
              '8.相关应急处置部门和抢险单位密切监视灾情，做好应急抢险救灾工作。'
            ]
          }, {
            icon: '/yujing/image/thunder_gust_red.png',
            meaning: '2小时内本地将受雷雨天气影响，平均风力可达10级以上，或者阵风12级以上，并伴有强雷电；或者已经受雷雨天气影响，平均风力为10级以上，或者阵风12级以上，并伴有强雷电，且将持续。',
            guide: [
              '1.严密关注雷雨大风最新消息和有关防御通知，迅速做好防御大风、雷电工作。',
              '2.立即停止户外活动和作业。',
              '3.居民应当关紧门窗，妥善安置室外搁置物和悬挂物。',
              '4.居民切勿外出，远离户外广告牌、棚架、铁皮屋、板房等易被大风吹动的搭建物，切勿在树下、电杆下、塔吊下躲避，应当留在有雷电防护装置的安全场所暂避。',
              '5.公园、景区、游乐场等户外场所应当立即发出警示信息，立即关闭相关区域，停止营业，组织人员避险。',
              '6.在建工地应当采取防护措施，加强工棚、脚手架、井架等设施和塔吊、龙门吊、升降机等机械、电器设备的安全防护，保障人员安全。',
              '7.机场、轨道交通、高速公路、港口码头等经营管理单位应当迅速采取措施，确保安全。',
              '8.相关应急处置部门和抢险单位密切监视灾情，做好应急抢险救灾工作。'
            ]
          }
        ],
        roadicing: [
          {
            icon: '/yujing/image/road_icing_yellow.png',
            meaning: '12小时内将出现对交通有影响的道路结冰。',
            guide: [
              '1.交通运输、公安机关交通管理等部门要做好应对准备工作；。',
              '2.驾驶人员应注意路况，安全行使。'
            ]
          },
          {
            icon: '/yujing/image/road_icing_orange.png',
            meaning: '6小时内将出现对交通有较大影响的道路结冰。',
            guide: [
              '1.行人出门行注意防滑。',
              '2.交通运输、公安机关交通管理等部门注意指挥和疏导行驶车辆。',
              '3.驾驶人员应当采取防滑措施，听从指挥，慢速行使。'
            ]
          }, {
            icon: '/yujing/image/road_icing_red.png',
            meaning: '2小时内将出现或者已经出现对交通有很大影响的道路结冰。',
            guide: [
              '1.居民尽量减少外出。',
              '2.有关部门适时采取交通安全管制措施，必要时封闭结冰道路。',
              '3.相关应急处置部门和抢险单位密切监视灾情，做好应急抢险救灾工作。'
            ]
          }
        ],
        hail: [
          {
            icon: '/yujing/image/hail_orange.png',
            meaning: '6小时内将出现或者已经出现冰雹，并可能造成雹灾。',
            guide: [
              '1.户外人员及时到安全的场所暂避。',
              '2.妥善安置易受冰雹影响的室外物品、车辆等。',
              '3.将家禽、牲畜等赶到带有顶蓬的安全场所。',
              '4.相关应急处置部门和抢险单位随时准备启动抢险应急方案。'
            ]
          }, {
            icon: '/yujing/image/hail_red.png',
            meaning: '2小时内出现冰雹的可能性极大或者已经出现冰雹，并可能造成重雹灾。',
            guide: [
              '1.户外人员立即到安全的场所暂避。',
              '2.妥善安置易受冰雹影响的室外物品、车辆等。',
              '3.将家禽、牲畜等赶到带有顶蓬的安全场所。',
              '4.相关应急处置部门和抢险单位密切监视灾情，做好应急抢险救灾工作。'
            ]
          }
        ],
        wildfire: [
          {
            icon: '/yujing/image/wild_fire_yellow.png',
            meaning: '较高火险，森林火险气象等级为三级。林内可燃物较易燃烧，森林火灾较易发生。',
            guide: [
              '1.进入森林防火防御状态，有关单位应当加强森林防火宣传教育，普及用火安全指引。',
              '2.加强巡山护林和野外用火的监管工作。',
              '3.进入森林防火区，注意防火；在森林防火区用火要做好防范措施，勿留火种。',
              '4.充分做好扑火救灾准备工作。'
            ]
          },
          {
            icon: '/yujing/image/wild_fire_orange.png',
            meaning: '高火险，森林火险气象等级为四级。林内可燃物容易燃烧，森林火灾容易发生，火势蔓延速度快。',
            guide: [
              '1.进入森林防火临战状态，有关单位应当进一步加强森林防火宣传教育。',
              '2、加大巡山护林和野外用火的监管力度。',
              '3.加强检查，禁止携带火种进山，严格管制野外火源。',
              '4.充分做好扑火救灾准备工作。'
            ]
          }, {
            icon: '/yujing/image/wild_fire_red.png',
            meaning: '极高火险，森林火险气象等级为五级。林内可燃物极易燃烧，森林火灾极易发生，火势蔓延速度极快。',
            guide: [
              '1.进入紧急防火状态，加强值班调度，密切注意林火信息动态。',
              '2.进一步加强巡山护林，落实各项防范措施，及时消除森林火灾隐患。',
              '3.严格检查，禁止携带火种进山，严格管制野外火源。',
              '4.政府可以发布命令，严禁一切野外用火，严格管理可能引发森林火灾的居民生活用火。',
              '5.做好扑火救灾充分准备工作，森林消防队伍要严阵以待。',
              '6.发生森林火灾时要及时、科学、安全扑救，确保人民群众生命财产安全。'
            ]
          }
        ]
      }
    }
  }
}
</script>
<style lang="scss" scoped>
.warning-meaning {
  width: 100%;
  padding: 20px 20px 0;
  box-sizing: border-box;
  .top {
    width: 100%;
    height: 34px;
    margin-bottom: 10px;
    .return {
      width: 130px;
      height: 34px;
      line-height: 34px;
      display: block;
      float: left;
      font-size: 14px;
      color: #ffffff;
      text-align: center;
      background-color: #025bc4;
    }
    .download {
      width: 310px;
      height: 14px;
      line-height: 14px;
      margin-top: 10px;
      float: right;
      font-size: 14px;
      color: #025bc4;
    }
  }
  .nav {
    width: 100%;
    margin-bottom: 10px;
    a {
      width: 92px;
      height: 32px;
      line-height: 32px;
      margin-left: 2px;
      display: inline-block;
      font-size: 12px;
      color: #ffffff;
      text-align: center;
      background-color: #2061aa;
    }
    .first {
      margin-left: 0;
    }
    .current {
      background-color: #ff6c00;
    }
  }
}
</style>
