<template>
  <div class="foshan-climate">
    <div class="title">佛山气候</div>
    <p class="sub-title">自然地理</p>
    <p>佛山是一座古老而又年轻的城市，位于广东省中南部、珠江三角洲腹地，东倚广州，西接肇庆，南连珠海，北通清远，毗邻港澳，地理位置十分优越。辖区内有西江、北江及其支流贯穿，境内地势平缓，多为冲积平原，河渠纵横，鱼塘密布，土地肥沃，自然资源主要有陶土、岩石、玻璃砂、稀有金属和塘鱼、水稻、甘蔗及品种繁多的水果、花卉等。</p>
    <p>佛山市辖禅城区、南海区、顺德区、高明区、三水区５区，总面积为3797.72平方公里。2013年末全市常住人口729.57万人。</p>
    <img src="/qihou/culture.jpg" />
    <p>佛山历史悠久，名胜古迹众多，是国家级历史文化名城。著名古迹有建筑雕塑艺术大观园之称的佛山祖庙、广东四大名园之一的梁园等。此外佛山秋色、佛山剪纸也别具南国特色。土特产有盲公饼、莲塘粉葛、河岩冬瓜等。</p>
    <p class="sub-title">气候概况</p>
    <p>佛山市属亚热带季风性湿润气候区，气候温和，雨量充足。年平均气温22.5℃，1月最冷，平均13.9℃，7月最热，平均29.2℃；年降雨量1681.2毫米（三水1688.7毫米，南海1677.4毫米，顺德1677.6毫米），西部和北部丘陵山地因地形抬升作用而稍多，年平均雨日 146.5天。雨季集中在4～9月，期间降雨量约占全年总降雨量的80％，夏季降水不均，旱涝无定，秋冬雨水明显减少。日照时数达1629.1小时，作物生长期长。</p>
    <p>由于地处低纬，海洋和陆地天气系统均对佛山有明显影响，冬夏季风的交替是佛山季风气候突出的特征：冬春多偏北风，夏季多偏南风。冬季的偏北风因极地大陆气团向南伸展而形成的，干燥寒冷；夏季偏南风因热带海洋气团向北扩张所形成的，温暖潮湿。</p>
    <p class="sub-title">冬季</p>
    <p>佛山的冬季普遍盛行东北风和北风，来自北方既寒冷又干燥的气团，从源地长途跋涉，势力大大减弱；同时，随着地面气温逐渐升高，气团原来寒冷干燥的性质，逐渐改变为较冷湿润的性质，到达广东时气压差也降低，因此风速也由北向南逐渐减小。当我们置身于冬的怀抱，随风侵来的并不都是入骨的寒冷，也不是满目的萧条与凄清。但是，也有个别年份例外，在寒潮来临时，也可能出现霜冻天气。冬季是佛山的干季，降水较少，晴好天气多，光照充足。1月份为最冷月，月平均气温为13.9℃，极端最低气温曾达到-1.9℃，出现在1967年1月17日。</p>
    <p class="sub-title">春季</p>
    <img src="/qihou/spring.jpg" />
    <p>佛山的春季，气温和降水量均处在上升时期，是冷暖天气交替变化的季节，所以不稳定性很大。从历年的情况来看，佛山的春天常常是阴雨绵绵，寒风料峭，“连绵春雨湿红棉”，这个季节的雨水是“让人欢喜让人愁”，虽然能滋润万物、过滤空气，但也淹没了阳光的踪影，因此春季又是日照最少的季节。由于缺乏阳光，气温日变化小，总让人感到寒意丝丝透骨。当然，有的年份也会出现春光明媚的景象，而在某些年份则因为雨季来得迟，可能出现持续性的干旱。通常雨季从4月份开始，我市进入前汛期。</p>
    <p class="sub-title">夏季</p>
    <p>由于受海洋气团的影响，佛山的夏季盛吹偏南风，丰沛的水汽随南风源源不断输送到上空，为夏季降雨提供有利条件。5、6月份是佛山前汛期的降雨高峰期，各地出现暴雨的机会甚多。同时，每年的6～10月又是热带气旋影响广东的主要时段。据统计，平均每年有5～6个热带气旋影响广东，登陆广东的也有3～4个，占登陆我国热带气旋个数的4成。因此夏季是雷暴和热带气旋肆虐的季节，全年中50%~60%的雨水都下在这个时候，毫无羁绊的雨伴着狂虐的风，往往形成严重的灾害。然而夏季的雨又常常是人们翘首期盼的。佛山的夏季绵长，天气炎热，一年中最热的月份是7月，全市的月平均气温达到29.2℃。极端的最高气温曾出现过39.2℃(2005年7月18日，南海区)。盛夏季节气温高，加上相对湿度大，更显得暑气逼人。因此，在人们期盼至极时悄然到来的雨水，夹着凉风，淅淅沥沥带走暑热，滋润心田，无疑是上天最好的馈赠。</p>
    <p class="sub-title">秋季</p>
    <img src="/qihou/autumn.jpg" />
    <p>告别炎夏，步入凉秋，天高云淡，好风长吟，秋天是一年中最舒适的季节。此时冷空气开始频繁南下，气温逐渐下降，飒飒秋风涤尽胸中的积郁，让人神清气爽。秋天并不是热带气旋活跃的季节，但仍有出现的可能，平均10年会有一个热带气旋登陆广东，随之而来的狂风骤雨自然是在所难免。总的来说，秋季多以晴天为主，少降水。据统计，从9月下旬至11月底平均降水量仅155.1毫米，约占全年降雨的十分之一，历史上还曾多次出现连续30天无雨的年份，秋燥的特点十分明显。</p>
    <p class="sub-title">气温</p>
    <p>佛山年平均气温自北向南介于22.2℃～22.7℃，相差只有0.5℃，年平均气温最高出现在2003年，为23.5℃。</p>
    <p>冬季是一年中最冷的季节，平均气温由北往南为14.4℃～15.2℃；春季，从3月份开始，气温回升到18.0℃；进入夏季，天气炎热，平均气温高达28.8℃，南、北地区的温差不明显；到了秋季，平均气温下降到24.2℃。</p>
    <p class="sub-title">气温的日较差</p>
    <p>一日中，最高气温与最低气温的差称为气温的日较差。本市的气温日较差，秋、冬季大于春、夏季。历年各季节平均气温日较差为：春季6.2℃，夏季7.0℃，秋季7.5℃，冬季 7.0℃。11月是一年中气温日较差最大的月份，其平均差值为8.0℃，3、4月份是一年中气温日较差最小的月份，其平均差值为6.0℃。</p>
    <p class="sub-title">极端最高气温的地区分布</p>
    <p>极端最高气温的地区分布为：南部38.7℃，中部39.2℃，北部39.1℃。日最高气温高于或等于35℃的天数为：北部平均21.5天，中部21.2天，南部19.0天。日最低气温低于或等于5℃的天数为：北部平均5.3天，中部3.8天，南部3.1天。</p>
    <p>以候平均气温低于10℃为冬季、高于22℃为夏季，而介于10～22℃为春季和秋季的标准来划分季节，佛山春秋短促，夏季绵长，无气候意义上的冬季。</p>
    <p class="sub-title">降水</p>
    <p>年平均降水量为1681.2毫米。</p>
    <p>月降水量分布特征。从4月份开始，降水量明显增多。4～6月是第一个多雨季节，称前汛期，主要是锋面低槽带来的降水，降水量为718.3毫米，占全年降水量的43％。7～9月份为第二个多雨季节，称后汛期，主要是热带气旋、热带辐合带等带来的降水，降水量在626.7毫米，占全年降水量的37％。10月份开始，降水明显减少。</p>
    <p>年平均降水日数为146.4天，北部比南部多。</p>
    <p class="sub-title">日照</p>
    <p>佛山市年平均日照时数1629.1小时，南多北少。1963年为历年日照时数最多的一年，其日照时数2433.5小时。最少的一年是1997年，为1150.4小时。</p>
    <p class="sub-title">相对湿度</p>
    <p> 佛山年平均相对湿度为76％。冬季，受干燥的大陆气团影响，相对湿度较小；春季，偏南气流开始活跃，来自海洋的水汽被源源不断输送到我市上空，因而相对湿度全年最大；夏季，南方潮湿气流依然活跃，空气中水汽丰沛，但由于气温高于春季，其相对湿度要比春季小；待到秋风起，北方冷空气不时侵扰，空气中的水汽含量越来越少，相对湿度随之逐渐减小。</p>
    <p class="sub-title">热带气旋</p>
    <p>热带气旋是产生于热带海洋上，以逆时针方向急速旋转的大气涡旋。根据热带气旋中心附近的风速，可将热带气旋分为几个不同类别。</p>
    <p>影响广东的热带气旋，产生于西太平洋和南海。每年的6～10月，是热带气旋影响广东的主要时段。在此期间，热带气旋的影响次数，占全年总影响次数的89％以上。</p>
    <p>据统计，佛山市受热带气旋影响年平均 1～2次。佛山市从4月到12月均会受热带气旋影响。初台最早一次是2008年4月18日，台风在海南省文昌市龙楼镇登陆，19日再次在阳江市阳东县登陆，佛山市出现阵风8~9级；最迟一次是1974年12月2日，台风在台山登陆，佛山市受其影响不大。7月是热带气旋影响率最高的一个月，其次是8月份，7～9月受热带气旋影响的次数占全年的75％。</p>
  </div>
</template>
<script>

export default {

}
</script>
<style lang="scss" scoped>
.foshan-climate {
  width: 100%;
  padding: 22px 45px 20px;
  box-sizing: border-box;
  font-family: "宋体";
  .title {
    width: 100%;
    height: 32px;
    line-height: 32px;
    margin-bottom: 40px;
    font-size: 30px;
    font-weight: 700;
    text-align: center;
  }
  p {
    line-height: 30px;
    margin-bottom: 30px;
    display: block;
    font-size: 16px;
    text-indent: 32px;
  }
  img {
    display: block;
  }
  .sub-title {
    font-weight: 700;
  }
}
</style>
